#!/usr/bin/env python
# coding: utf-8

# In[1]:


print("************************************************")
print("*        WELCOME TO   SUPKAORN B.STORE         *")
print("************************************************")
print("Vat Code     POS#E041500388399999999999999999999")
print("")
print("            ใบเสร็จรับเงิน/ใบกำกับภาษีอย่างย่อ          ")
print(2,"ชิ้น  ","โค้ก             ","14 THB  ", 2*14 ,"THB")
print(2,"ชิ้น  ","คุ้กกี้โอรีโอ้        ","15 THB  ", 2*15 ,"THB")
print(1,"ชิ้น  ","L&M 7.1 แดง     ","60 THB  ", 1*60 ,"THB")
print(3,"ชิ้น  ","ปลากระป๋องโรซ่า    ","14 THB  ", 3*18 ,"THB")
print("ส่วนลดโค้ก                        ",5 ,"THB")
print("ยอดสุธิ    8  ชิ้น      ",((2*14)+(2*15)+(1*60)+(3*18))-5,"THB")
print("เงินสด/เงินทอน         ",200,"THB   ",200-(((2*14)+(2*15)+(1*60)+(3*18))-5),"THB")
print("")
print("")
print("")
print("******************THANK YOU********************")


# In[ ]:




